#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Отец', 'Мама', 'Брат', 'Я']
print(my_family)

# список списков приблизителного роста членов вашей семьи
my_family_height = [
    ['Отец', 190],
    ['Мама', 185],
    ['Брат', 174],
    ['Я', 183]
]
print(my_family_height[0])

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
